
// ============================================================================
// Bootloader
// ----------------------------------------------------------------------------

"Clover_title" = "Clover EFI";
"Clover_description" = "Clover EFI wymaga trzech podstawowych plików. (w skrócie)
boot0 (w głównym rekordzie startowym dysku) odpowiedzialny za ładowanie boot1.
boot1 (w boot sektorze partycji) odpowiedzialny za odnajdowanie boot2.
boot2 (w głównym katalogu partycji) odpowiedzialny za ładowanie /EFI/BOOT/CLOVERIA32.efi lub CLOVERX64.efi, kernel etc.";

"boot0_title" = "1. BIOS MBR boot0 (HFS+Fat32)";
"boot0_description" = "Opcja do ładowania systemu za pośrednictwem BIOSu.
Używa pliku fdisk440 do instalacji boot0 do pierwszych 440 bitów głównego sektora rozruchowego bez uszkadzania istniejących systemów Windows, następnie boot0 wyszuka pierwszej aktywnej partycji HFS, boot1h2 lub pierwszą aktywną partycję Fat32 dla boot1f32alt.
Opcja ta ustawi wybraną partycję HFS lub Fat32 jako aktywną.
Wymagane jest sformatowanie partycji na Fat32 w Windowsie lub w Mac OS wg poniższej instrukcji.
  1. Wymazanie partycji jako MS-DOS (FAT) w Narzędziu Dyskowym. Natępnie wykonanie poniższych komend w Terminalu:
  2. diskutil list
  3. diskutil unmount /dev/rdiskXsY (gdzie X to numer dysku a Y to numer partycji)
  4. newfs_msdos -v Fat32 -F 32 /dev/rdiskXsY
  5. diskutil mount /dev/rdiskXsY";

"boot0hfs_title" = "1. BIOS MBR boot0hfs (HFS+Fat32)";
"boot0hfs_description" = "Opcja do ładowania systemu za pośrednictwem BIOSu.
Używa pliku fdisk440 do instalacji boot0 do pierwszych 440 bitów głównego sektora rozruchowego bez uszkadzania istniejących systemów Windows, następnie boot0hfs wyszuka partycji HFS, boot1h2 lub pierwszą aktywną partycję Fat32 dla boot1f32alt.
Opcja ta nie ustawi wybranej partycji HFS jako aktywnej jednak partycja Fat32 zostanie aktywowana.
Wymagane jest sformatowanie partycji na Fat32 w Windowsie lub w Mac OS wg poniższej instrukcji.
  1. Wymazanie partycji jako MS-DOS (FAT) w Narzędziu Dyskowym. Natępnie wykonanie poniższych komend w Terminalu:
  2. diskutil list
  3. diskutil unmount /dev/rdiskXsY (gdzie X to numer dysku a Y to numer partycji)
  4. newfs_msdos -v Fat32 -F 32 /dev/rdiskXsY
  5. diskutil mount /dev/rdiskXsY";

"boot0EFI_title" = "1. BIOS GPT EFI (HFS+Fat32)";
"boot0EFI_description" = "Opcja do ładowania systemu za pośrednictwem BIOSu.
Używa pliku fdisk440 do instalacji boot0 do pierwszych 440 bitów głównego sektora rozruchowego bez uszkadzania istniejących systemów Windows, następnie boot0hfs wyszuka pierwszej partycji GPT EFI, boot1h2 lub boot1f32alt.
Opcja ta nie ustawi wybranej partycji jako aktywnej.
Wymagane jest sformatowanie partycj EFI jako HFS w Mac OS. W tym celu wykonać należy poniższe komendy w Terminalu:
  diskutil list
  newfs_hfs -v EFI /dev/rdiskXsY (gdzie X to numer dysku a Y to numer partycji)
Lub sformatowanie EFI jako Fat32 w Mac OS. W tym celu wykonać należy poniższe komendy w Terminalu:
  diskutil list
  newfs_msdos -v EFI -F 32 /dev/rdiskXsY (gdzie X to numer dysku a Y to numer partycji)";

"boot1no_title" = "1. Wypakowanie plików";
"boot1no_description" = "Opcja do ładowania systemu za pośrednictwem BIOSu.
Nie instaluje żadnego pliku (boot0 , boot0hfs, boot0md, boot1h2, boot1f32alt). Opcja przewidziana dla dysków z 4kb sektorem do ręcznej instalacji.";

"boot1UEFI_title" = "1. UEFI boot (dla płyt głównych z UEFI)";
"boot1UEFI_description" = "Używany do ładowania systemu za pośrednictwem UEFI.
Nie instaluje żadnego pliku (boot0 , boot0hfs, boot0md, boot1h2, boot1f32alt).
Opcja ta zainstaluje kilka wymaganych sterowników do /EFI/drivers32 oraz do /EFI/drivers64 dla opcji rozruchu z UEFI.
Wymagane jest ustawienie rozruchu w UEFI BIOSie:
UEFI -> /EFI/BOOT/CloverX64.efi -> boot.efi -> OS X";

"boot32_title" = "2. Instalacja i startowanie w trybie 32bit";
"boot32_description" = "Instaluje plik boot i startuje system w 32 bitach.
Podczas rozruchu można:
Wcisnąć klawisz 1 do uruchomienia boot1 = Chameleon boot,
Wcisnąć klawisz 3 do uruchomienia boot3 = Clover EFI 32bit boot,
Wcisnąć klawisz 6 do uruchomienia boot6 = Clover EFI 64bit boot.";

"boot64_title" = "2. Instalacja i startowanie w trybie 64bit";
"boot64_description" = "Instaluje plik boot i startuje system w 64 bitach.
Podczas rozruchu można:
Wcisnąć klawisz 1 do uruchomienia boot1 = Chameleon boot,
Wcisnąć klawisz 3 do uruchomienia boot3 = Clover EFI 32bit boot,
Wcisnąć klawisz 6 do uruchomienia boot6 = Clover EFI 64bit boot.";
// ============================================================================
// Themes
// ----------------------------------------------------------------------------

"Themes_title" = "Tematy graficzne";
"Themes_description" = "Wybierz w celu zainstalowania.";

"black_green_title" = "black_green";
"black_green_description" = "Domyślny temat black_green od Blackosx,
Lokalizacja tematu: /EFI/BOOT/themes/black_green.";

"AppleStyle_title" = "AppleStyle";
"AppleStyle_description" = "AppleStyle theme od Eps,
Lokalizacja tematu: /EFI/BOOT/themes/AppleStyle.";

"mrengles_title" = "mrengles";
"mrengles_description" = "mrengles theme od mrengles,
Lokalizacja tematu: /EFI/BOOT/themes/mrengles.";

"iClover_title" = "iClover";
"iClover_description" = "Grey style theme by winlog,
Lokalizacja tematu: /EFI/BOOT/themes/iClover.";

"buttons_title" = "buttons";
"buttons_description" = "Temat Buttons od Trauma,
Lokalizacja instalacji tematu: /EFI/BOOT/themes/buttons.";

"hellfire_title" = "hellfire";
"hellfire_description" = "Temat Hellfire od illevelll,
Lokalizacja instalacji tematu: /EFI/BOOT/themes/hellfire.";

"metal_title" = "metal";
"metal_description" = "Oryginalny temat metal od Slice,
Lokalizacja instalacji tematu: /EFI/BOOT/themes/metal.";

"simple_gray_title" = "simple_gray";
"simple_gray_description" = "Temat Simple_gray od hijeane,
Lokalizacja instalacji tematu: /EFI/BOOT/themes/simple_gray.";

"wooden_title" = "wooden";
"wooden_description" = "Temat Wooden od iROOTa,
Lokalizacja instalacji tematu: /EFI/BOOT/themes/wooden.";

// ----------------------------------------------------------------------------